twoPhaseStratifiedFlow/meshA/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1e-06 0);

boundaryField
{
"proc.*"
{
	type	processor;
	value	uniform (0 0 0);
}
// No-slip at the walls parallel to the interface
    Wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    
// Zero-gradient BC for inlet/outlet
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    
// Interfacial BC    
    interface
    {
        type            interfaceCoupledVelocityFlux;
        secondOrder             yes;
        nonOrthCorr             yes;
        neighbourRegionName meshB;
        neighbourPatchName interfaceShadow;
        neighbourFieldName U;
        k               "muFluidA";
       value           uniform (0 0 0);
    }
    centerline
    {
        type            symmetryPlane;
    }
    upperWedge
    {
        type            wedge;
    }
    lowerWedge
    {
        type            wedge;
    }
}


// ************************************************************************* //
